# Les bases de données

Un des usages majeurs de Python correspond au traitement de données et à son analyse. 
Dans ce cours on se concentrera sur la librairie pandas pour faire du traitement de données. Puis nous verrons comment afficher les résultats obtenus.

Une petite introduction à l'analyse de données sera faite.

Voici l'ensemble des librairies dont on va se servir pendant ce cours :

Mon adresse mail : boussena.md@gmail.com

On peut aussi installer directement depuis le notebook !

In [1]:
!pip install pandas

No Python at '"C:\Users\bouss\AppData\Local\Programs\Python\Python311\python.exe'

In [2]:
#LIBRAIRIE UTILISEE (A INSTALLER)
import pandas as pd
import numpy as np 
import matplotlib
import matplotlib.pyplot as plt

In [3]:
import datetime 
import random
import sqlite3

#Pas besoin pour aujourd'hui 
import seaborn as sns
import plotly

# Création d’un DataFrame

D'une manière générale, un DataFrame correspond à une liste de dictionnaires qui partagent des clé communes. 

On a vu dans le cours précédent comment créer et remplir un dictionnaire d'éléments, et aussi le fonctionnement des listes.

On commence donc par définir une fonction qui à un nom donné renvoie des notes entre 0 et 20 (avc possibilités d'avoir des notes en 0.5)

In [4]:
def notes_eleve(eleve):
    note = {'nom' : eleve, 'Maths' : random.randint(0,40)/2,
                "Physique" : random.randint(0,40)/2,
                'SVT' : random.randint(0,40)/2,
               'Français' : random.randint(0,40)/2}
    return note

In [5]:
notes_eleve("Mohamed")

{'nom': 'Mohamed',
 'Maths': 0.0,
 'Physique': 12.0,
 'SVT': 17.5,
 'Français': 5.0}

On crée ensuite notre liste de dictionnaires :

In [6]:
Liste_prenom = ["Emile","Joseph","Patrick","Léa","Andrew","Johanna"]
data_note = []
for x in Liste_prenom: 
    data_note.append(notes_eleve(x))
data_note

[{'nom': 'Emile',
  'Maths': 7.0,
  'Physique': 16.5,
  'SVT': 17.5,
  'Français': 2.0},
 {'nom': 'Joseph',
  'Maths': 9.5,
  'Physique': 16.5,
  'SVT': 5.5,
  'Français': 2.5},
 {'nom': 'Patrick',
  'Maths': 18.5,
  'Physique': 3.5,
  'SVT': 8.5,
  'Français': 15.5},
 {'nom': 'Léa', 'Maths': 2.5, 'Physique': 3.0, 'SVT': 13.0, 'Français': 10.5},
 {'nom': 'Andrew',
  'Maths': 0.5,
  'Physique': 6.5,
  'SVT': 19.5,
  'Français': 15.0},
 {'nom': 'Johanna',
  'Maths': 10.0,
  'Physique': 0.0,
  'SVT': 2.0,
  'Français': 11.0}]

In [7]:
Liste_prenom = ["Emile","Joseph","Patrick","Léa","Andrew","Johanna"]
data_note = [notes_eleve(x) for x in Liste_prenom]
data_note

[{'nom': 'Emile',
  'Maths': 5.5,
  'Physique': 16.5,
  'SVT': 20.0,
  'Français': 4.5},
 {'nom': 'Joseph',
  'Maths': 17.0,
  'Physique': 0.0,
  'SVT': 11.5,
  'Français': 8.0},
 {'nom': 'Patrick',
  'Maths': 6.5,
  'Physique': 1.0,
  'SVT': 15.0,
  'Français': 0.5},
 {'nom': 'Léa',
  'Maths': 14.5,
  'Physique': 16.5,
  'SVT': 20.0,
  'Français': 12.0},
 {'nom': 'Andrew', 'Maths': 8.0, 'Physique': 4.0, 'SVT': 7.5, 'Français': 6.0},
 {'nom': 'Johanna',
  'Maths': 18.5,
  'Physique': 2.0,
  'SVT': 7.0,
  'Français': 2.5}]

In [8]:
df_note = pd.DataFrame(data_note)
df_note

       nom  Maths  Physique   SVT  Français
0    Emile    5.5      16.5  20.0       4.5
1   Joseph   17.0       0.0  11.5       8.0
2  Patrick    6.5       1.0  15.0       0.5
3      Léa   14.5      16.5  20.0      12.0
4   Andrew    8.0       4.0   7.5       6.0
5  Johanna   18.5       2.0   7.0       2.5

In [9]:
import pandas as pd

In [10]:
pd.DataFrame(data_note)

       nom  Maths  Physique   SVT  Français
0    Emile    5.5      16.5  20.0       4.5
1   Joseph   17.0       0.0  11.5       8.0
2  Patrick    6.5       1.0  15.0       0.5
3      Léa   14.5      16.5  20.0      12.0
4   Andrew    8.0       4.0   7.5       6.0
5  Johanna   18.5       2.0   7.0       2.5

In [11]:
def notes_eleve_2(list_eleve):
    labels = ['nom', 'Maths', 'Physique', 'SVT', 'Français']
    note = {}
    for j in labels :
        note[j] = {}
    for i in range(len(list_eleve)):
        for j in labels:
            if j == "nom":
                note[j][i] = list_eleve[i]
            else : 
                note[j][i] = random.randint(0,40)/2
    return note

In [12]:
data_note2 = notes_eleve_2(["Emile","Joseph","Patrick","Léa","Andrew","Johanna"])
data_note2

{'nom': {0: 'Emile',
  1: 'Joseph',
  2: 'Patrick',
  3: 'Léa',
  4: 'Andrew',
  5: 'Johanna'},
 'Maths': {0: 10.5, 1: 0.0, 2: 14.0, 3: 9.5, 4: 5.0, 5: 15.0},
 'Physique': {0: 6.5, 1: 13.5, 2: 15.5, 3: 8.5, 4: 14.5, 5: 17.5},
 'SVT': {0: 2.5, 1: 15.5, 2: 13.5, 3: 8.5, 4: 3.5, 5: 15.0},
 'Français': {0: 15.5, 1: 8.5, 2: 2.5, 3: 3.0, 4: 1.5, 5: 5.0}}

In [13]:
pd.DataFrame(data_note2)

       nom  Maths  Physique   SVT  Français
0    Emile   10.5       6.5   2.5      15.5
1   Joseph    0.0      13.5  15.5       8.5
2  Patrick   14.0      15.5  13.5       2.5
3      Léa    9.5       8.5   8.5       3.0
4   Andrew    5.0      14.5   3.5       1.5
5  Johanna   15.0      17.5  15.0       5.0

Pour créer un DataFrame à partir de ce fichier, on utilise la méthode pd.DataFrame

In [14]:
df_note = pd.DataFrame(data_note)
df_note

       nom  Maths  Physique   SVT  Français
0    Emile    5.5      16.5  20.0       4.5
1   Joseph   17.0       0.0  11.5       8.0
2  Patrick    6.5       1.0  15.0       0.5
3      Léa   14.5      16.5  20.0      12.0
4   Andrew    8.0       4.0   7.5       6.0
5  Johanna   18.5       2.0   7.0       2.5

In [15]:
df_note2 = pd.DataFrame(data_note2)
df_note2 #Les résultats diffèrent à cause du random mais la structure est la même.

       nom  Maths  Physique   SVT  Français
0    Emile   10.5       6.5   2.5      15.5
1   Joseph    0.0      13.5  15.5       8.5
2  Patrick   14.0      15.5  13.5       2.5
3      Léa    9.5       8.5   8.5       3.0
4   Andrew    5.0      14.5   3.5       1.5
5  Johanna   15.0      17.5  15.0       5.0

Les différentes écritures permettent de mieux gérer les différentes formes d'écritures possibles d'un DataFrame.
la méthode to_dict(), inversement transforme un DataFrame en dictionnaire (plusieurs formes sont disponibles)

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_dict.html

In [16]:
df_note.to_dict()

{'nom': {0: 'Emile',
  1: 'Joseph',
  2: 'Patrick',
  3: 'Léa',
  4: 'Andrew',
  5: 'Johanna'},
 'Maths': {0: 5.5, 1: 17.0, 2: 6.5, 3: 14.5, 4: 8.0, 5: 18.5},
 'Physique': {0: 16.5, 1: 0.0, 2: 1.0, 3: 16.5, 4: 4.0, 5: 2.0},
 'SVT': {0: 20.0, 1: 11.5, 2: 15.0, 3: 20.0, 4: 7.5, 5: 7.0},
 'Français': {0: 4.5, 1: 8.0, 2: 0.5, 3: 12.0, 4: 6.0, 5: 2.5}}

In [17]:
df_note.to_dict("split")

{'index': [0, 1, 2, 3, 4, 5],
 'columns': ['nom', 'Maths', 'Physique', 'SVT', 'Français'],
 'data': [['Emile', 5.5, 16.5, 20.0, 4.5],
  ['Joseph', 17.0, 0.0, 11.5, 8.0],
  ['Patrick', 6.5, 1.0, 15.0, 0.5],
  ['Léa', 14.5, 16.5, 20.0, 12.0],
  ['Andrew', 8.0, 4.0, 7.5, 6.0],
  ['Johanna', 18.5, 2.0, 7.0, 2.5]]}

In [18]:
df_note.to_dict("index") #On retombe sur la première écriture que je trouve plus agréable.

{0: {'nom': 'Emile',
  'Maths': 5.5,
  'Physique': 16.5,
  'SVT': 20.0,
  'Français': 4.5},
 1: {'nom': 'Joseph',
  'Maths': 17.0,
  'Physique': 0.0,
  'SVT': 11.5,
  'Français': 8.0},
 2: {'nom': 'Patrick',
  'Maths': 6.5,
  'Physique': 1.0,
  'SVT': 15.0,
  'Français': 0.5},
 3: {'nom': 'Léa',
  'Maths': 14.5,
  'Physique': 16.5,
  'SVT': 20.0,
  'Français': 12.0},
 4: {'nom': 'Andrew',
  'Maths': 8.0,
  'Physique': 4.0,
  'SVT': 7.5,
  'Français': 6.0},
 5: {'nom': 'Johanna',
  'Maths': 18.5,
  'Physique': 2.0,
  'SVT': 7.0,
  'Français': 2.5}}

In [19]:
df_note.to_dict("index")[1]

{'nom': 'Joseph', 'Maths': 17.0, 'Physique': 0.0, 'SVT': 11.5, 'Français': 8.0}

In [20]:
dico = {"chien": 12,"chat": 1,"loup":0}

list(dico.values())

[12, 1, 0]

In [21]:
list(dico.keys())

['chien', 'chat', 'loup']

In [22]:
list(df_note.to_dict("index").values())

[{'nom': 'Emile',
  'Maths': 5.5,
  'Physique': 16.5,
  'SVT': 20.0,
  'Français': 4.5},
 {'nom': 'Joseph',
  'Maths': 17.0,
  'Physique': 0.0,
  'SVT': 11.5,
  'Français': 8.0},
 {'nom': 'Patrick',
  'Maths': 6.5,
  'Physique': 1.0,
  'SVT': 15.0,
  'Français': 0.5},
 {'nom': 'Léa',
  'Maths': 14.5,
  'Physique': 16.5,
  'SVT': 20.0,
  'Français': 12.0},
 {'nom': 'Andrew', 'Maths': 8.0, 'Physique': 4.0, 'SVT': 7.5, 'Français': 6.0},
 {'nom': 'Johanna',
  'Maths': 18.5,
  'Physique': 2.0,
  'SVT': 7.0,
  'Français': 2.5}]

# Gestion des valeurs manquantes

In [23]:
def notes_eleve_2filiere(eleve):
    note = {'nom' : eleve, 'Maths' : random.randint(0,40)/2,
                'SVT' : random.randint(0,40)/2,
               'Français' : random.randint(0,40)/2}
    if random.randint(0,1):
        note["Physique"] = random.randint(0,40)/2
    else : 
        note["Economie"] = random.randint(0,40)/2
    return note

Attention si l'on &écrit "np.nan", on aura une chaine de caractères et non une valeur vide !!

In [24]:
def notes_eleve_2filiere_Attention(eleve):
    note = {'nom' : eleve, 'Maths' : random.randint(0,40)/2,
                'SVT' : random.randint(0,40)/2,
               'Français' : random.randint(0,40)/2}
    if random.randint(0,1):
        note["Physique"] = random.randint(0,40)/2
        note["Economie"] = ""
    else : 
        note["Economie"] = random.randint(0,40)/2
        note["Physique"] = ""
    return note

In [25]:
Liste_prenom = ["Emile","Joseph","Patrick","Léa","Andrew","Johanna"]

data_note_2filiere = [notes_eleve_2filiere(x) for x in Liste_prenom]

data_note_2filiere_attention = [notes_eleve_2filiere_Attention(x) for x in Liste_prenom]

In [26]:
data_note_2filiere

[{'nom': 'Emile',
  'Maths': 5.0,
  'SVT': 2.0,
  'Français': 16.5,
  'Economie': 18.5},
 {'nom': 'Joseph',
  'Maths': 12.0,
  'SVT': 4.5,
  'Français': 6.5,
  'Physique': 8.5},
 {'nom': 'Patrick',
  'Maths': 2.0,
  'SVT': 13.0,
  'Français': 1.0,
  'Economie': 12.0},
 {'nom': 'Léa', 'Maths': 10.0, 'SVT': 5.5, 'Français': 12.0, 'Physique': 4.0},
 {'nom': 'Andrew',
  'Maths': 0.5,
  'SVT': 10.5,
  'Français': 1.5,
  'Economie': 19.0},
 {'nom': 'Johanna',
  'Maths': 3.0,
  'SVT': 0.0,
  'Français': 11.0,
  'Economie': 1.5}]

In [27]:
df_note_2filiere = pd.DataFrame(data_note_2filiere)
df_note_2filiere

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
1   Joseph   12.0   4.5       6.5       NaN       8.5
2  Patrick    2.0  13.0       1.0      12.0       NaN
3      Léa   10.0   5.5      12.0       NaN       4.0
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

In [28]:
df_note_2filiere_attention = pd.DataFrame(data_note_2filiere_attention)
df_note_2filiere_attention

       nom  Maths   SVT  Français Economie Physique
0    Emile   12.0  18.5       9.0     11.0
1   Joseph   19.5  15.5      12.5     17.5
2  Patrick    8.0   4.5       7.0      0.5
3      Léa    5.5   3.5       8.5              18.0
4   Andrew   14.5   0.5       7.0      1.0
5  Johanna   19.0  11.0      10.0               2.0

Avoir accès au subset de chacune des filières :

isna() est une méthode qui renvoie True ou False selon que les données sont vides ou non.

In [29]:
df_note_2filiere

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
1   Joseph   12.0   4.5       6.5       NaN       8.5
2  Patrick    2.0  13.0       1.0      12.0       NaN
3      Léa   10.0   5.5      12.0       NaN       4.0
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

In [30]:
df_note_2filiere.Physique.isna()

0     True
1    False
2     True
3    False
4     True
5     True
Name: Physique, dtype: bool

In [31]:
df_note_2filiere_attention

       nom  Maths   SVT  Français Economie Physique
0    Emile   12.0  18.5       9.0     11.0
1   Joseph   19.5  15.5      12.5     17.5
2  Patrick    8.0   4.5       7.0      0.5
3      Léa    5.5   3.5       8.5              18.0
4   Andrew   14.5   0.5       7.0      1.0
5  Johanna   19.0  11.0      10.0               2.0

In [32]:
#Si l'on a remplit le DataFrame par "" par défaut,
#la méthode isna() affichera systématiquement False

df_note_2filiere_attention.Economie.isna()

0    False
1    False
2    False
3    False
4    False
5    False
Name: Economie, dtype: bool

In [33]:
df_note_2filiere_attention["Economie"].isna()

0    False
1    False
2    False
3    False
4    False
5    False
Name: Economie, dtype: bool

ON peut alors s'en servir de filtre pour, par exemple n'afficher que les données où la Colonne Economie est vide. 

df[Filtre] fait l'affaire. Et le filtre est une expression qui opère sur tout le dataframe.

In [34]:
df_note_2filiere

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
1   Joseph   12.0   4.5       6.5       NaN       8.5
2  Patrick    2.0  13.0       1.0      12.0       NaN
3      Léa   10.0   5.5      12.0       NaN       4.0
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

In [35]:
df_note_2filiere[df_note_2filiere.Economie.isna()]

      nom  Maths  SVT  Français  Economie  Physique
1  Joseph   12.0  4.5       6.5       NaN       8.5
3     Léa   10.0  5.5      12.0       NaN       4.0

In [36]:
df_note_2filiere[~(df_note_2filiere.Economie.isna())]

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
2  Patrick    2.0  13.0       1.0      12.0       NaN
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

Si l'on veut avoir accès aux données des élèves qui ont plus de la moyenne en maths : 

On n'a pas beosin de créer un nouveau jeu de données pour les filtres mais on effectue l'opération qui nous affiche True ou False.

In [37]:
df_note_2filiere

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
1   Joseph   12.0   4.5       6.5       NaN       8.5
2  Patrick    2.0  13.0       1.0      12.0       NaN
3      Léa   10.0   5.5      12.0       NaN       4.0
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

In [38]:
(df_note_2filiere.Maths >= 10)

0    False
1     True
2    False
3     True
4    False
5    False
Name: Maths, dtype: bool

On veut afficher les élèves qui n'ont pas eu la moyenne en maths :

In [39]:
df_note_2filiere[(df_note_2filiere.Maths < 10) ]

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
2  Patrick    2.0  13.0       1.0      12.0       NaN
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

Si l'on veut ceux qui ont eu la moyenne :

In [40]:
df_note_2filiere[(df_note_2filiere.Maths >= 10) ]

      nom  Maths  SVT  Français  Economie  Physique
1  Joseph   12.0  4.5       6.5       NaN       8.5
3     Léa   10.0  5.5      12.0       NaN       4.0

In [41]:
df_note_2filiere[~(df_note_2filiere.Maths < 10) ]

      nom  Maths  SVT  Français  Economie  Physique
1  Joseph   12.0  4.5       6.5       NaN       8.5
3     Léa   10.0  5.5      12.0       NaN       4.0

OU :

In [42]:
df_note_2filiere

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
1   Joseph   12.0   4.5       6.5       NaN       8.5
2  Patrick    2.0  13.0       1.0      12.0       NaN
3      Léa   10.0   5.5      12.0       NaN       4.0
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

In [43]:
df_note_2filiere_attention = pd.DataFrame(data_note_2filiere_attention)
df_note_2filiere_attention

       nom  Maths   SVT  Français Economie Physique
0    Emile   12.0  18.5       9.0     11.0
1   Joseph   19.5  15.5      12.5     17.5
2  Patrick    8.0   4.5       7.0      0.5
3      Léa    5.5   3.5       8.5              18.0
4   Andrew   14.5   0.5       7.0      1.0
5  Johanna   19.0  11.0      10.0               2.0

In [44]:
df_note_2filiere[(df_note_2filiere.Economie >= 10) & ~(df_note_2filiere.Economie.isna())  ]  # ~ prend l'opposé de l'expression à l'intérieur

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
2  Patrick    2.0  13.0       1.0      12.0       NaN
4   Andrew    0.5  10.5       1.5      19.0       NaN

In [45]:
df_note_2filiere_attention

       nom  Maths   SVT  Français Economie Physique
0    Emile   12.0  18.5       9.0     11.0
1   Joseph   19.5  15.5      12.5     17.5
2  Patrick    8.0   4.5       7.0      0.5
3      Léa    5.5   3.5       8.5              18.0
4   Andrew   14.5   0.5       7.0      1.0
5  Johanna   19.0  11.0      10.0               2.0

In [46]:
df_note_2filiere_attention[(df_note_2filiere_attention.Economie < 10) ]

TypeError: '<' not supported between instances of 'str' and 'int'

In [47]:
"a" >"b"

False

In [48]:
1 > 2

False

In [49]:
"" < 10

TypeError: '<' not supported between instances of 'str' and 'int'

In [50]:
"bonjour" > 10

TypeError: '>' not supported between instances of 'str' and 'int'

In [51]:
df_note_2filiere

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
1   Joseph   12.0   4.5       6.5       NaN       8.5
2  Patrick    2.0  13.0       1.0      12.0       NaN
3      Léa   10.0   5.5      12.0       NaN       4.0
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

In [52]:
df_note_2filiere.dtypes

nom          object
Maths       float64
SVT         float64
Français    float64
Economie    float64
Physique    float64
dtype: object

In [53]:
df_note_2filiere_attention

       nom  Maths   SVT  Français Economie Physique
0    Emile   12.0  18.5       9.0     11.0
1   Joseph   19.5  15.5      12.5     17.5
2  Patrick    8.0   4.5       7.0      0.5
3      Léa    5.5   3.5       8.5              18.0
4   Andrew   14.5   0.5       7.0      1.0
5  Johanna   19.0  11.0      10.0               2.0

In [54]:
df_note_2filiere_attention.dtypes

nom          object
Maths       float64
SVT         float64
Français    float64
Economie     object
Physique     object
dtype: object

Supposons que l'on veuille savoir qui est le meilleur en Français par rapport aux matières scientifiques

In [55]:
df_note_2filiere

       nom  Maths   SVT  Français  Economie  Physique
0    Emile    5.0   2.0      16.5      18.5       NaN
1   Joseph   12.0   4.5       6.5       NaN       8.5
2  Patrick    2.0  13.0       1.0      12.0       NaN
3      Léa   10.0   5.5      12.0       NaN       4.0
4   Andrew    0.5  10.5       1.5      19.0       NaN
5  Johanna    3.0   0.0      11.0       1.5       NaN

In [56]:
df_note_2filiere[["Français","Economie"]].mean(axis = 1)

0    17.50
1     6.50
2     6.50
3    12.00
4    10.25
5     6.25
dtype: float64

In [57]:
df_note_2filiere["Moyenne_Scientifique"] = df_note_2filiere[["Maths","SVT","Physique"]].mean(axis=1)
df_note_2filiere

       nom  Maths   SVT  Français  Economie  Physique  Moyenne_Scientifique
0    Emile    5.0   2.0      16.5      18.5       NaN              3.500000
1   Joseph   12.0   4.5       6.5       NaN       8.5              8.333333
2  Patrick    2.0  13.0       1.0      12.0       NaN              7.500000
3      Léa   10.0   5.5      12.0       NaN       4.0              6.500000
4   Andrew    0.5  10.5       1.5      19.0       NaN              5.500000
5  Johanna    3.0   0.0      11.0       1.5       NaN              1.500000

In [58]:
df_note_2filiere[["Français"]].astype(int)

   Français
0        16
1         6
2         1
3        12
4         1
5        11

In [59]:
df_note_2filiere[(df_note_2filiere["Moyenne_Scientifique"] < df_note_2filiere["Français"])]

       nom  Maths  SVT  Français  Economie  Physique  Moyenne_Scientifique
0    Emile    5.0  2.0      16.5      18.5       NaN                   3.5
3      Léa   10.0  5.5      12.0       NaN       4.0                   6.5
5  Johanna    3.0  0.0      11.0       1.5       NaN                   1.5

In [60]:
df_note_2filiere[(df_note_2filiere.Economie.isna())]

      nom  Maths  SVT  Français  Economie  Physique  Moyenne_Scientifique
1  Joseph   12.0  4.5       6.5       NaN       8.5              8.333333
3     Léa   10.0  5.5      12.0       NaN       4.0              6.500000

In [61]:
df_note_2filiere[~(df_note_2filiere.Economie.isna())] # ~ permet de prendre la négation de l'expression demandée.

       nom  Maths   SVT  Français  Economie  Physique  Moyenne_Scientifique
0    Emile    5.0   2.0      16.5      18.5       NaN                   3.5
2  Patrick    2.0  13.0       1.0      12.0       NaN                   7.5
4   Andrew    0.5  10.5       1.5      19.0       NaN                   5.5
5  Johanna    3.0   0.0      11.0       1.5       NaN                   1.5

In [62]:
df_note_2filiere_physique = df_note_2filiere[(df_note_2filiere.Economie.isna())]  
df_note_2filiere_physique

      nom  Maths  SVT  Français  Economie  Physique  Moyenne_Scientifique
1  Joseph   12.0  4.5       6.5       NaN       8.5              8.333333
3     Léa   10.0  5.5      12.0       NaN       4.0              6.500000

In [63]:
df_note_2filiere_eco = df_note_2filiere[~(df_note_2filiere.Economie.isna())]  
df_note_2filiere_eco

       nom  Maths   SVT  Français  Economie  Physique  Moyenne_Scientifique
0    Emile    5.0   2.0      16.5      18.5       NaN                   3.5
2  Patrick    2.0  13.0       1.0      12.0       NaN                   7.5
4   Andrew    0.5  10.5       1.5      19.0       NaN                   5.5
5  Johanna    3.0   0.0      11.0       1.5       NaN                   1.5

In [64]:
df_note_2filiere_eco.fillna(0)

       nom  Maths   SVT  Français  Economie  Physique  Moyenne_Scientifique
0    Emile    5.0   2.0      16.5      18.5       0.0                   3.5
2  Patrick    2.0  13.0       1.0      12.0       0.0                   7.5
4   Andrew    0.5  10.5       1.5      19.0       0.0                   5.5
5  Johanna    3.0   0.0      11.0       1.5       0.0                   1.5

On peut faire le choix de remplir ses NaN values. Ici, remplir des notes n'aurait pas de sens (cela pourrait fausser la moyenne par exemple)

Mais dans d'autres cas de figures, on peut vouloir s'en servir, en utilisant la méthode .fillna()

Exercice : Créer une base de données avec comme matière (Maths Physique SVT Philosophie Littérature Français et Histoire) pour 15 étudiants.
    
Calculer la moyenne scientifique et la moyenne littéraire puis la moyenne globale !

Quels sont les étudiants qui ont une moyenne littéraire supérieur à leur moyenne scientifique ?

Calculer la moyenne de classe en maths ! (Un résultat à part pas besoin de créer une nouvelle colonne)

In [65]:
def notes(eleve):
    note = {'nom' : eleve, 'Maths' : random.randint(0,40)/2,
                "Physique" : random.randint(0,40)/2,
                'SVT' : random.randint(0,40)/2,
               'Philosophie' : random.randint(0,40)/2,
           'Littérature' : random.randint(0,40)/2,
            'Français' :random.randint(0,40)/2,
           'Histoire' : random.randint(0,40)/2}
    return note

In [66]:
Liste_prenom = ["Emile","Joseph","Patrick","Léa","Andrew","Johanna"]
df_note = [notes(x) for x in Liste_prenom]
df_note = pd.DataFrame(df_note)

In [67]:
df_note

,nom,Maths,Physique,SVT,Philosophie,Littérature,Français,Histoire
0,Emile,5.5,8.0,1.0,18.5,14.0,14.0,0.0
1,Joseph,14.0,18.5,1.0,9.0,1.0,9.0,18.0
2,Patrick,14.0,16.5,13.0,11.0,5.5,4.5,6.5
3,Léa,1.0,11.0,8.0,20.0,20.0,1.5,0.5
4,Andrew,3.5,16.5,6.0,4.0,18.0,17.0,4.0
5,Johanna,8.0,10.0,7.5,7.5,18.0,4.5,16.5

In [68]:
df_note["Moyenne_Scientifique"] = df_note[["Maths","Physique","SVT"]].mean(axis =1)
df_note["Moyenne_Litteraire"] = df_note[["Philosophie",'Littérature',"Français","Histoire"]].mean(axis =1)
df_note["Moyenne_Generale"] = df_note[["Maths","Physique","SVT","Philosophie",'Littérature',"Français","Histoire"]].mean(axis =1)

In [69]:
df_note

,nom,Maths,Physique,SVT,Philosophie,Littérature,Français,Histoire,Moyenne_Scientifique,Moyenne_Litteraire,Moyenne_Generale
0,Emile,5.5,8.0,1.0,18.5,14.0,14.0,0.0,4.833333,11.625,8.714286
1,Joseph,14.0,18.5,1.0,9.0,1.0,9.0,18.0,11.166667,9.250,10.071429
2,Patrick,14.0,16.5,13.0,11.0,5.5,4.5,6.5,14.500000,6.875,10.142857
3,Léa,1.0,11.0,8.0,20.0,20.0,1.5,0.5,6.666667,10.500,8.857143
4,Andrew,3.5,16.5,6.0,4.0,18.0,17.0,4.0,8.666667,10.750,9.857143
5,Johanna,8.0,10.0,7.5,7.5,18.0,4.5,16.5,8.500000,11.625,10.285714

In [70]:
df_note[df_note["Moyenne_Scientifique"] < df_note["Moyenne_Litteraire"]]

,nom,Maths,Physique,SVT,Philosophie,Littérature,Français,Histoire,Moyenne_Scientifique,Moyenne_Litteraire,Moyenne_Generale
0,Emile,5.5,8.0,1.0,18.5,14.0,14.0,0.0,4.833333,11.625,8.714286
3,Léa,1.0,11.0,8.0,20.0,20.0,1.5,0.5,6.666667,10.500,8.857143
4,Andrew,3.5,16.5,6.0,4.0,18.0,17.0,4.0,8.666667,10.750,9.857143
5,Johanna,8.0,10.0,7.5,7.5,18.0,4.5,16.5,8.500000,11.625,10.285714

In [71]:
#Moyenne de classe en maths

df_note["Maths"].mean(axis = 0)

7.666666666666667

In [72]:
df_note["Maths"].mean() #l'argument axis = 0 est un paramètre par défaut.

7.666666666666667